Autodesk.Revit.UI.ProjectBrowserDataProvider.SetFirstVisibleItemIndex(Autodesk.Revit.DB.Document,System.Int32)
Set the first visible item Index for scrolling
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetFirstVisibleItemIndex(Autodesk.Revit.DB.Document)
Returns the first visible item Index for scrolling
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllSelectedItemsIndex(Autodesk.Revit.DB.Document)
Returns all project browser items' index
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024